[
{"title": "A Comic Artist’s Survival Guide", "image_url": "https://asura.gg/wp-content/uploads/2022/04/cover1.jpg", "rating": "8", "status": "Coming Soon", "description": ["Snow, a failing comic artist whose comic is about to be discontinued, reincarnates into his own comic by chance. In his comic, the Pante Continent is on the verge of ruin due to the expansion of the Demon King’s army, resulting in Snow being in danger as well. Just as his life was about to end, Snow receives an opportunity to survive, with the condition that he takes over the author’s role and rewrites the entire comic’s storyline. If he fails to ” create” a more interesting story, then Snow and the comic world would be destroyed…"], "author": "", "category": "Manhua", "genres": ["Action", "Adventure", "Fantasy", "Isekai", "Shounen"]},
{"title": "Demon in Mount Hua", "image_url": "https://asura.gg/wp-content/uploads/2022/07/demonmounthuaCover01.png", "rating": "9.5", "status": "Ongoing", "description": ["The Murim’s public enemy, the Slaughterer Demon Monarch, Yeom Se-Ak! It’s been a hundred years since he was trapped in Mount Hua after being captured by the Sword God, Han Ho.", "He waited all these years for his chance to seek revenge…", "The long period of time caused this incident to be forgotten by the world, and eventually, even the Yeom Se-Ak was forgotten.", "But.", "“Sir, what is your name…?”", "A coincidental meeting, and the name of an archenemy that he said unwittingly, “H-Han Ho.”", "At the end of a vain journey, an unexpected path branches out. The ultimate demon that’s in Mount Hua, Yeom Se-Ak’s choice!"], "author": "", "category": "Manhwa", "genres": ["Action", "Martial Arts"]},
{"title": "Archmage Transcending Through Regression", "image_url": "https://asura.gg/wp-content/uploads/2022/10/ArchmageTranscendingCover01.png", "rating": "9.8", "status": "Ongoing", "description": ["Mikhail Walpurgis, the world’s only 9th-circle Archmage, fell in battle due to a damned hero, and managed to cast one final advanced magic spell, ", ". As time rewound, he regressed to 20 years ago.", "“Fine. I’ll just become the hero instead.”", " ", " ", " "], "author": "", "category": "Manhwa", "genres": ["Action", "Adventure", "Fantasy", "Regression"]},
{"title": "Above the Heavens", "image_url": "https://asura.gg/wp-content/uploads/2021/09/abovetheheavenscover-1.jpg", "rating": "9.0", "status": "Dropped", "description": ["College student Zhou Mingyu has been targeted by various forces in the warlock world for possessing a strange power called [Tengu].", "In order to eliminate the influence of [Tengu] on him and to unveil the truth about his father’s death, a mysterious event that took place in the Kunlun Mountains more than a hundred years ago is revealed…"], "author": "", "category": "Manhua", "genres": ["Action", "Fantasy", "Shounen", "Supernatural"]},
{"title": "Arcana Fantasy", "image_url": "https://asura.gg/wp-content/uploads/2020/12/tall.jpg", "rating": "8", "status": "Ongoing", "description": ["Arcana Fantasy, a mobile game, has taken the world by storm. However, players lose consciousness in the real world and are trapped in the game until someone completes it. Can Yoon, the son of a pro gamer, find his father in the virtual world?"], "author": "", "category": "Manhwa", "genres": ["Adventure", "Fantasy", "Shounen", "Video Games", "Virtual Reality"]},
{"title": "Academy’s Undercover Professor", "image_url": "https://asura.gg/wp-content/uploads/2022/06/Academys_Undercover_ProfessorCover_copy.png", "rating": "9.7", "status": "Ongoing", "description": ["I became a professor in the best academy of the Empire because I… was mistaken for someone else. I’m in a situation where I can’t get caught by either side. I wonder where this dangerous tight-rope walking situation will lead me to?", " ", " ", " ", " ", " ", " ", " ", " "], "author": "", "category": "Manhwa", "genres": ["Action", "Adventure", "Comedy", "Drama", "Fantasy", "School Life", "Supernatural"]},
{"title": "Absolute Sword Sense", "image_url": "https://asura.gg/wp-content/uploads/2022/06/swordsenseCover03.png", "rating": "9.2", "status": "Ongoing", "description": ["[From the author of ", "]", "\nAfter being given up on by his family because his dantian was destroyed, Soh Woonhwi was kidnapped by the Blood Cult and lived as a third-rate spy. One day, he died while being used to find a legendary sword immortal’s secret records. However, he returned to the day he was kidnapped ten years ago and obtained a mysterious ability that allowed him to hear the voice of swords.", " "], "author": "", "category": "Manhwa", "genres": ["Action", "Adventure", "Martial Arts", "Murim", "Returner"]},
{"title": "Demon Lord’s Martial Arts Ascension", "image_url": "https://asura.gg/wp-content/uploads/2022/11/DemonLordCover02.png", "rating": "9.7", "status": "Ongoing", "description": ["“Demon Lord.”", "That’s…", "\nWhat they used to call me in my past life, before I became human."], "author": "", "category": "Manhwa", "genres": ["Action", "Adventure", "Demon", "Fantasy", "Martial Arts"]},
{"title": "Champion’s Path to Murim", "image_url": "https://asura.gg/wp-content/uploads/2022/09/PathtoMurimCover01.png", "rating": "9.6", "status": "Ongoing", "description": ["Known as “Mister Perfect”, the Champion, Kim Sanghyuk, was a living legend in the world of mixed martial arts. However, he was one day reborn into the Murim world as the youngest member of the Golden Tiger Wall! “This time, I’ll forge a new legend in the Murim!” The Murim, which was home to a medley of martial arts and techniques, suddenly welcomed an oddity who was trained in Boxing, Taekwondo, Muay Thai, Wrestling, Jujitsu, Capoeira, Judo, and a variety of modern martial arts. He’s ready to shake things up!"], "author": "", "category": "Manhwa", "genres": ["Action", "Adventure", "Fantasy", "Martial Arts", "Rebirth"]},
{"title": "Damn Reincarnation", "image_url": "https://asura.gg/wp-content/uploads/2022/06/Damn_ReincarnationCover003.png", "rating": "9.9", "status": "Ongoing", "description": ["[From the author of ", "]", "Hamel, a warrior who traveled with his colleagues to exterminate the devil. Unfortunately, he died just before the battle with the devil started. “Yes.” What the hell? He was reborn as the descendant of his fellow warrior, Vermouth. The descendant from the bloodline of the great Vermouth, Hamel. No, he was now Eugene Lionhart. “It was already enough with me having the delusion that I was a genius in my past life. But… this… It’s… It’s incomparable.’ From a dying body to a new body, he has the achievement that he did not have in his previous life. And, a reincarnation of an unknown origin, the reality of living together with the demons. Facing a new world where everything is questionable. The journey of the unfinished previous life begins with Eugene’s body."], "author": "", "category": "Manhwa", "genres": ["Action", "Adventure", "Fantasy", "Shounen"]},
{"title": "Demonic Spirit King", "image_url": "https://asura.gg/wp-content/uploads/2021/11/DemonicSpiritKing.jpg", "rating": "9.6", "status": "Dropped", "description": ["In a world where the murim world of the past continued onto the present…", "After the killer ‘Demonic Spirit King’ vanished into thin air, the murim world was at peace.", "However, one day, a drug that increases the internal energy of the people of murim appears and disrupts the balance of power.", "Just in time, the ‘Demonic Spirit King’ shows himself to the world once again,", "And throws the world of murim into a vortex of chaos once again…"], "author": "", "category": "Manhwa", "genres": ["Action", "Fantasy", "Martial Arts"]},
{"title": "Chronicles Of The Martial God’s Return", "image_url": "https://asura.gg/wp-content/uploads/2022/05/martialreturnCover01.png", "rating": "9.6", "status": "Ongoing", "description": ["The sixth masterpiece of the Wuxia Genre that’ll meet your expectations, just like the [Third-rate Chronicles of Return], [The Conquer of the Heavenly Faction], and the [Chronicles of Seven Dragons and Seven Demons]. [Chronicles of the Martial God’s Return] The Ultimate Martial Divine Demon, Dan Woohyun, was sealed up because he was too strong for the world to handle. After a millennium passed by, he was released from his seal and felt like everything was meaningless as he wandered the back alleys… Just as he fell down because he was sick of the world, a small hand appeared in front of him. “What’s this?” asked Dan Woohyun. “A dumpling!” came a reply. This was the first time in his life that someone had been nice to him without any impure intentions, and that changed his fate. This is the chronicles of a martial god who traversed through a thousand years of time and space!", "\n", "\n"], "author": "", "category": "Manhwa", "genres": ["Action", "Murim", "Overpowered", "Return"]},
{"title": "Carnivorous Hunter", "image_url": "https://asura.gg/wp-content/uploads/2022/07/CarniHunterColor02.png", "rating": "9.4", "status": "Ongoing", "description": ["With beasts appearing all over the world, billions of people have died to the catastrophic event. Part of the survivors who lived became “metahumans”. They were people who would be able to face off against the beasts, as such, a huge gap between metahumans and the humans who weren’t able to transition opened. Kim Seonwoo is a regular human guide for the metahumans’ beast subjugation. On the verge of their death, he heard a voice in his head say: “Kill them.” “Kill them and take their power!”", " "], "author": "", "category": "Manhwa", "genres": ["Action", "Adventure", "Fantasy", "Mature", "Seinen", "Supernatural"]},
{"title": "Emperor’s Domination", "image_url": "https://asura.gg/wp-content/uploads/2022/03/f3556622c9ac203f7800dd88f8efe81126b1bbf8.jpg", "rating": "9.0", "status": "Dropped", "description": ["The rise of revered cultivators has been witnessed for countless years.", "However, the eyes of the world fail to notice that, behind every cultivator, there seems to be a mysterious…", "Yin crow. After the Yin crow guided a legion of young cultivators to the peak of cultivation and established a sect, he chose to leave and abandon it.", "\nThousands of years have passed since his departure, and circumstances have changed. The once brilliant sect was left in shambles and vulnerable to imminent danger.", "Aware of the impending downfall, the Yin crow returned as a young boy in order to fulfill his agreement to guard and restore the sect to its former glory."], "author": "", "category": "Manhua", "genres": []},
{"title": "Death Is the Only Ending for the Villainess", "image_url": "https://asura.gg/wp-content/uploads/2020/10/Screenshot-2022-10-29-205433.png", "rating": "9.4", "status": "Ongoing", "description": ["Penelope Eckart reincarnated as the adopted daughter of Duke Eckart and the villainess of a reverse harem dating sim. The problem is, she entered the game at its hardest difficulty, and no matter what she does, death awaits her at every ending! Before the “real daughter” of Duke Eckart appears, she must choose one of the male leads and reach a happy ending in order to survive. But the two brothers always pick a fight with her over every little thing, as well as a crazy crown prince, whose routes all lead to death. There’s even a magician who’s enamoured with the female lead and a loyal slave knight! But somehow, the favourability meters of the male leads increase the more she crosses the line with them!", "This is Penelope’s survival story, who’s been dropped in an insane reverse harem dating sim!"], "author": "", "category": "Manhwa", "genres": ["Drama", "Fantasy", "Historical", "Psychological", "Romance", "Shoujo"]},
{"title": "Drug Devourer", "image_url": "https://asura.gg/wp-content/uploads/2022/10/DrugDevourerCover01.png", "rating": "9.5", "status": "Ongoing", "description": ["One day, a gate suddenly opened in the heavens, bringing with it the invasion of monsters and the intervention of monks in the human world.", "『Miracle Drug “Coffee” Administration』", "『Medicinal Contents: Caffeine and Sugar』", "\n☞ Provides energy", "\n☞ Stimulates the central nervous system", "\n☞ Maximizes senses and reflexes", "The whole world appeared to slow down, and Hanyul’s medications began to show their true effects."], "author": "", "category": "Manhwa", "genres": ["Action", "Adventure", "Fantasy", "Shounen"]},
{"title": "Dungeon Odyssey", "image_url": "https://asura.gg/wp-content/uploads/2022/09/dungeonOdyCover03.png", "rating": "9.7", "status": "Ongoing", "description": ["The descendants of mankind, born in the labyrinth and raised on the milk of monsters, possessed special strength and strong bodies. When they returned to earth, mankind referred to them as dungeon babies. Among them, Kim Jinwoo was born in the deepest labyrinth.", "“I never tried to become strong, I just wanted to live.”", "From the lowliest excavator to the king of the labyrinth, his life story is now unfolding."], "author": "", "category": "Manhwa", "genres": ["Action", "Adventure", "Fantasy", "Shounen"]},
{"title": "Barbarian Quest", "image_url": "https://asura.gg/wp-content/uploads/2022/04/BarbQuest_hElookkindadumbaf-1.jpg", "rating": "9.9", "status": "Ongoing", "description": ["The greatest warrior of the Boulder Axe Tribe, Urich.", "\nHe accomplished what others in his tribe could not, and went beyond the ‘Sky Mountain Range’.", "What he saw beyond the mountains was,", "Different clothing being worn, different languages being spoken,", "\nand unfamiliar people in iron-clad armor.", "“So, the realm past the mountains wasn’t just a spirit world for the dead!”", "An uncharted world, and the one who faces it,", "Barbarian Urich is headed towards the civilized world!"], "author": "", "category": "Manhwa", "genres": []},
{"title": "Duke Pendragon", "image_url": "https://asura.gg/wp-content/uploads/2021/12/Illustration3.jpg", "rating": "9.9", "status": "Ongoing", "description": ["Born as the successor of a low-ranking noble household, Raven Varte wears the sin of plotting a rebellion against the empire. To be granted amnesty, he was sent to fight demons alongside the worst corp of the empire, the ”Demon” corp. Most say that it is a place where most won’t survive for even a year, but Raven somehow managed to survive for ten. When his amnesty was in front of his eyes, on his last battlefield, he met the ‘Successor of the Pendragon Duke Household, Eren Pendragon.", " "], "author": "", "category": "Manhwa", "genres": ["Action", "Demon", "Fantasy"]},
{"title": "Doctor’s Rebirth", "image_url": "https://asura.gg/wp-content/uploads/2021/01/doctors-rebirth-cover.jpg", "rating": "9.9", "status": "Ongoing", "description": ["I had been abroad to do medical volunteer work, when I was swept up in a civil war. I was killed by a rebel soldier while taking a bullet for a patient. But when I finally woke up, I had become a child?!?", "And in front of me stood a destroyed carriage and a group of oddly dressed people, who were unconscious!", "“It’s just like a Murim world.”", "As I hurry to perform first aid in an attempt to save even one person, I realize that this world is that of [The Supreme Demon King], a Murim novel I’ve enjoyed reading.", "After meeting the rescue team of the ‘Three Great Doctors’, I found out that one of the people I saved was the protagonist of this novel, the future Demon King ‘Yeoharyun’!", "“Hey, since I’m indebted to you for saving me, call me ‘hyung’.”", "For saving his life, I become sworn brothers with the future Demon King, and Baekrineuison, one of the most knowledgeable people around, recognized my potential and took me in as his disciple. This is the story of how I became the greatest physician in Gangho!", " ", " "], "author": "", "category": "Manhwa", "genres": ["Action", "Fantasy", "Isekai", "Martial Arts"]},
{"title": "I Became a Renowned Family’s Sword Prodigy", "image_url": "https://asura.gg/wp-content/uploads/2022/06/swordprodigyCover02.png", "rating": "8.8", "status": "Ongoing", "description": ["Baek Woojin is the youngest son of a renowned swordsman family who has neither talent in swordsmanship nor an impressive Aura, despite trying harder than anyone", " Although he was dishonored by his own family and killed, he reincarnates as the owner of a Magic Sword. His only goal is the destruction of his own family."], "author": "", "category": "Manhwa", "genres": ["Action", "Adventure", "Fantasy", "Reincarnation"]},
{"title": "I Regressed As The Duke", "image_url": "https://asura.gg/wp-content/uploads/2022/04/unknown_1-1.png", "rating": "9.2", "status": "Ongoing", "description": ["The son of the great Emperor Gline,", "\nPrince “Aaron”, is the recipient of the “Dragon’s Blessing”.", "\nBut because of the rebellion led by his uncle, “Zerone”,", "\nHe was banished to the outskirts of the kingdom, ‘Brahn Grounds’.", "“Emperor Zerone will kill us all…”", "Keeping his father’s dying wish to forget about the crown and revenge,", "\nAaron had been living powerlessly as the Duke of a barren land… but one day,", "\nEmperor Zerone invaded Brahn Grounds!", "\nHe didn’t come just for Aaron’s life,", "but rather, his aim was to destroy Brahn Grounds!", "Even the loyal subject, “Gayle”, disappeared into ashes", "\nas he watched Duke Aaron and Brahn Grounds disappear", "\nin midst of Emperor Zerone’s flames.", "At least, that’s what we thought happened!", "When he opened his eyes,", "\nGayle found himself in the position of a younger Prince Aaron!", "“I won’t live while hiding my power like the Duke did!”", "By using any means necessary to develop the land,", "\nand preparing for Emperor Zerone’s invasion that will happen 20 years,", "\nhe decides to take back the spot of Emperor which he was robbed of!"], "author": "", "category": "Manhwa", "genres": ["Action", "Adventure", "Fantasy", "Returner"]},
{"title": "I Obtained a Mythic Item", "image_url": "https://asura.gg/wp-content/uploads/2022/06/IObtainedaMythicItemCover04.png", "rating": "9.8", "status": "Ongoing", "description": ["D-Rank non-combat raider becomes a great enemy of god that will save the world with the strongest restoration item."], "author": "", "category": "Manhwa", "genres": ["Action", "Adventure", "Fantasy", "Revenge", "Shounen"]},
{"title": "Ending Maker", "image_url": "https://asura.gg/wp-content/uploads/2022/05/ending_maker_01.jpg", "rating": "9.7", "status": "Ongoing", "description": ["There are two people who were obssessed with the game, Legend of Heroes 2, and spent thousands of hours on it.", "\nThe forever number one, Kang Jinho, and the forever number two, Hong Yoohee.", "\nOne day, when they woke up, they had been reincarnated into their characters within the game…", "“Hey… You too?”", "\n“Hey… Me too!”", "Legend of Heroes 2’s ending is the end of the human world.", "However, since there are two of them instead of just one, and not just any two, but the server’s rank one and rank two, things could be different.", "The journey of the veteran gamers to accomplish the happy ending starts now!"], "author": "", "category": "Manhwa", "genres": ["Action", "Comedy", "Fantasy", "Romance", "Video Game"]},
{"title": "Hoarding in Hell", "image_url": "https://asura.gg/wp-content/uploads/2022/05/cover2.jpg", "rating": "9.5", "status": "Ongoing", "description": ["Kang Hyunmoo is a dirt-poor man whose dreams of becoming a hunter were torn apart.", "But one day, while he was dreaming of getting rich quick, something appeared in front of him… [Difficulty: Hell. You are entering the Star of Apocalypse.] “…What?” He’ll now be monopolizing items and skills in a future Earth overrun with monsters!", " ", " "], "author": "", "category": "Manhwa", "genres": ["Action", "Dungeons", "Shounen"]},
{"title": "I Grow Stronger By Eating!", "image_url": "https://asura.gg/wp-content/uploads/2021/05/IMG_8074.png", "rating": "9", "status": "Ongoing", "description": ["Everyone has a talent of their own.", "And the talent I have is ‘eating’.", "A talent that shines much brighter in this world where countless powerful organisms dwell.", " ", "Feast Devour.", "Consume the blood and flesh of the strong and make that yours.", "Even if it’s a dragon, a demon king, or a god!"], "author": "", "category": "Manhwa", "genres": ["Action", "Adventure", "Fantasy", "Isekai", "Mature", "Monsters", "Psychological", "Shounen"]},
{"title": "How To Live As a Villain", "image_url": "https://asura.gg/wp-content/uploads/2021/11/liveasvillain.jpg", "rating": "9.8", "status": "Ongoing", "description": ["Congratulations!", " ", "You have been chosen to become a player in a great game that will decide who becomes the successor of a god!", " ", "Sunghoon was suddenly thrown into another world to participate in a survival game to become a god.", "\nA fantasy game-like other world, where players either support or kill each other…!!", " ", "The talentless Sunghoon uses his wickedness and crude tricks to become all-powerful!"], "author": "", "category": "Manhwa", "genres": ["Action", "Adventure"]},
{"title": "Heavenly Sword’s Grand Saga", "image_url": "https://asura.gg/wp-content/uploads/2022/06/grandSagaCover02.png", "rating": "9.8", "status": "Ongoing", "description": ["[From the author of ", "]", "There are people in the world that thinks they are the ‘chosen’ of the heavens. It’s been decades since chaos and strife among heroes ensued because of those people. A certain disciple who has six masters has been entrusted with the fate of the central plains. “If you guys are the heavens, then I’m the sword that’ll pierce the heavens.” That was what he’d resolved to do… No one mentioned he was a fatty, though! In any case, now that he’s here, he’ll need to save the… world… Damn it, lose some weight first.", " "], "author": "", "category": "Manhwa", "genres": ["Action", "Adventure", "Comedy", "Martial Arts", "Murim"]},
{"title": "Hero Has Returned", "image_url": "https://asura.gg/wp-content/uploads/2021/06/heroc-2-1.png", "rating": "9.5", "status": "Dropped", "description": ["Park Jung-Soo, a hero who saved another world with a single determination to take his revenge against", "Kim Min-Soo. He saved himself, but could not save his world, so he decided to kill the heroes who destroyed it.", "This story is about a hero who kills those heroes, a cold reality with no happy ending"], "author": "", "category": "Manhwa", "genres": ["Action", "Fantasy", "Isekai", "Mature", "Return", "Shounen", "Tragedy"]},
{"title": "I Am the Fated Villain", "image_url": "https://asura.gg/wp-content/uploads/2021/11/fatedvillain-2.jpg", "rating": "9.9", "status": "Ongoing", "description": ["Immediately after Gu Changge realized he had transgressed into a fantasy world, the world’s protagonist, and fortune’s chosen, vowed to take revenge on him. Envied by all, he not only has the female lead head over heels for him but he’s also treated as a distinguished guest wherever he goes. Fortunately, Gu Changge’s prestige and power are superior to everyone else’s, so shouldn’t it be easy to trample on a mere fortune’s chosen?", " ", "Hold on… There’s a system dedicated to milking and harvesting from the protagonist? Gu Changge smirked. “Seems like even fate wants me to fulfill my destiny as the Villain of this world!”"], "author": "", "category": "Manhua", "genres": ["Action", "Cultivation", "Fantasy", "Isekai", "Martial Arts", "System", "Villain"]},
{"title": "I Reincarnated As The Crazed Heir", "image_url": "https://asura.gg/wp-content/uploads/2021/07/Title-Cover-kopya.png", "rating": "9.2", "status": "Ongoing", "description": ["Yang Jagak, who was assassinated through poison during the political wars of the", "Murim. While he thought he was dead, he realized he was in the body of another person.", "He found out that he is in the Demon Cult, the art he knows is the Heavenly Demon God Arts, and the owner of the body was the crazed heir who lusted after women.", "Why did it need to be the Demon Cult, and why did it need to be this person?", " ", " "], "author": "", "category": "Manhwa", "genres": ["Action", "Martial Arts", "Reincarnation"]},
{"title": "Heavenly Inquisition Sword", "image_url": "https://asura.gg/wp-content/uploads/2022/10/inquisitionSwordCover02.png", "rating": "9.5", "status": "Ongoing", "description": ["“He is the master of the Nine Heavens.”", "Yeon Jeokha was the child of a second wife. Viciously bullied by his father’s first wife and his siblings, he was later imprisoned in a warehouse after his father died of illness…", "It has been ten years since his escape after he had learned martial arts that were out of the world.", "“I regard the Yeon Family with great bitterness.”", "The unstoppable adventure of the sole successor of the Heavenly Inquisition Sword, Yeon Jeokha, begins now!"], "author": "", "category": "Manhwa", "genres": ["Action", "Adventure", "Martial Arts", "Murim"]},
{"title": "I Regressed to My Ruined Family", "image_url": "https://asura.gg/wp-content/uploads/2022/11/myruinedfamilyCover01.png", "rating": "9.6", "status": "Ongoing", "description": ["I was born as the oldest of a renowned swordsman family, and became stronger faster than anyone.", "\nYet, I could not stop the dragons, a great disaster that had appeared on the continent.", "\nI closed my eyes in my final moments, thinking everything was over.", "\nI really thought it was over…", "\nBut when I opened my eyes, I was back in the past.", "\nA past that was very different from the world I knew.", "“What? Is this really my body? Why don’t I have any mana?”", "\n“Where did the castle go? Why’s there only a wooden house left?”", "\n“…What? The dragons and humans made a non-aggression pact?”", "A family that had fallen and was on the brink of ruin.", "\nA family whose writing of divination had vanished.", "\nAnd a body in which no mana could be found!", "“…I’ll have to keep myself busy from now on.”", "The great hero of a renowned swordsman family.", "\nHe is back in the past, in a ‘parallel world’.", " "], "author": "", "category": "Manhwa", "genres": ["Action", "Adventure", "Fantasy", "Regression"]},
{"title": "Heavenly Martial God", "image_url": "https://asura.gg/wp-content/uploads/2021/09/martialgod.jpg", "rating": "9.3", "status": "Ongoing", "description": ["“Who’s this male prostitute-looking kid?” I am the Matchless Ha Hoo Young, the greatest martial artist reigning over all the lands! There is no one that is my equal! I was drowning in futility and emptiness because there was no more that I could accomplish in the human realm. To reach the peak of martial arts, I must become a saint! “I finally succeeded!!!” “Stop! Your ascension is not permitted!” The other saints refused my ascension due to my karma after much slaughter, and I fell, just like that.", "\nWhen I woke up, I was 60 years in the future. I was reborn as the second lord of the Namgoong family, Namgoong Hyuk. Where has all the internal energy that I’ve accumulated gone?! Moreover, I have the Nine yin energy blockage?"], "author": "", "category": "Manhwa", "genres": ["Action", "Adventure", "Martial Arts"]},
{"title": "Heavenly Demon Instructor", "image_url": "https://asura.gg/wp-content/uploads/2021/12/heavenlydemoninstructor-1.jpg", "rating": "9.6", "status": "Ongoing", "description": ["“Master, what’s the next lesson?!!!”", " ", "A disaster that struck the earth, [Portal Impact], caused Park Hyunsoo, the MC, to lose his parents before his eyes.", "\nThe only family member he has left is his younger sibling who is unconscious.", "\nIn order to protect his younger sibling, he did his best but as a powerless support, he would always be on the other side of contempt…", "\nAnd that’s when a helper, Chungyeong, appeared!", "\nChungyeong, a murim martial master that has travelled through time to come here from the Murim to teach Hyunsoo martial arts…", " ", "“Hey, disciple…”", "\n“Yes, Master.”", " "], "author": "", "category": "Manhwa", "genres": ["Action", "Adventure", "Dungeons", "Fantasy", "Martial Arts", "Monsters", "Murim", "Shounen", "System"]}